{
  "start": {
    "story": {
      "pt": "<p>Depois que terminei a faculdade percebi um problema no mercado: para conseguir um emprego preciso de experiência, porém para conseguir experiência preciso trabalhar.</p><p>Preciso de QI (quem indica) e contatos, mas a maioria dos meus colegas estão na mesma situação que a minha, afinal, quem é que quer contratar uma advogada sem experiência profissional?</p><p>Por que um lugar pequeno me contrataria se pode pegar alguém que realmente saberia defender a empresa que suou tanto para construir e por que uma empresa maior me escolheria entre tantos candidatos?</p><p>O que me faz diferir dos outros advogados? Qual seria meu nicho?</p><p>Faz alguns meses que estou presa desse limbo. Antes ficava horas procurando vagas e me inscrevendo, hoje em dia… fico no meu computador jogando ou vendo memes.</p><p>Mas, nesses últimos tempos encontrei um novo hobby.",
      "en": "<p><b>You</b> are in a dark forest. </p><p>The dense vegetation creates a mysterious and intriguing atmosphere. The silence is broken only by the sound of branches moving in the wind. </p><p>Do you want to go left or right, {{playerName}}?</p>"
    },
    "choices": [
      {
        "text": {
          "pt": "▶",
          "en": "▶"
        },
        "next": "left"
      }
    ]
  },
  "left": {
    "story": {
      "pt": "Você encontra uma cabana abandonada, {{playerName}}.",
      "en": "You come across an abandoned cabin, {{playerName}}."
    },
    "choices": [
      {
        "text": {
          "pt": "Investigar a cabana, {{playerName}}.",
          "en": "Investigate the cabin, {{playerName}}."
        },
        "next": "investigate"
      },
      {
        "text": {
          "pt": "Continuar a explorar a floresta, {{playerName}}.",
          "en": "Continue exploring the forest, {{playerName}}."
        },
        "next": "continue"
      }
    ]
  },
  "investigate": {
    "story": {
      "pt": "Você entra na cabana e encontra uma mesa com alguns objetos antigos. Há também uma escada que desce para um porão escuro. O que você quer fazer?",
      "en": "You enter the cabin and find a table with some old objects. There's also a staircase leading down to a dark basement. What do you want to do?"
    },
    "choices": [
      {
        "text": {
          "pt": "Investigar a mesa",
          "en": "Investigate the table"
        },
        "next": "investigateTable"
      },
      {
        "text": {
          "pt": "Explorar o porão",
          "en": "Explore the basement"
        },
        "next": "exploreBasement"
      },
      {
        "text": {
          "pt": "Voltar para fora",
          "en": "Go back outside"
        },
        "next": "goOutside"
      }
    ]
  },
  "continue": {
    "story": {
      "pt": "Você decide continuar sua exploração na floresta sombria. Enquanto caminha, você encontra uma trilha estreita que parece ser pouco usada. O que você quer fazer?",
      "en": "You decide to continue your exploration in the dark forest. As you walk, you come across a narrow trail that seems to be less traveled. What do you want to do?"
    },
    "choices": [
      {
        "text": {
          "pt": "Seguir a trilha",
          "en": "Follow the trail"
        },
        "next": "followTrail"
      },
      {
        "text": {
          "pt": "Continuar na rota original",
          "en": "Continue on the original route"
        },
        "next": "continueOriginalRoute"
      },
      {
        "text": {
          "pt": "Voltar para a bifurcação",
          "en": "Go back to the fork"
        },
        "next": "goBackToFork"
      }
    ]
  }
}
